Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/Atmel.SAME70_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         xmlns:saxon="http://saxon.sf.net//"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Atmel</vendor>
   <url>http://packs.download.atmel.com/</url>
   <name>SAME70_DFP</name>
   <description>Atmel SAME70 Series Device Support</description>
   <releases>
      <release version="2.3.98" date="2018-01-30">Updated device XML for rev. B devices. Updated/added SVD files.</release>
      <release version="2.2.91">Added rev. B devices.</release>
      <release version="2.1.82">Corrected number of TC channels.</release>
      <release version="2.0.78">Fixed EFC parameters. Added EBI module. Removed duplicate DACC module.</release>
      <release version="2.0.71">Added core and DACC peripherals. Updated headers, startup code and linker scripts.</release>
      <release version="1.0.50">Updated documentation links.</release>
      <release version="1.0.27">Updated documentation links.</release>
      <release version="1.0.21">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Atmel</keyword>
      <keyword>Device Family Package Atmel</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAME70</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAME70" Dvendor="Atmel:3">
         <device Dname="ATSAME70J19">
            <processor Dcore="Cortex-M7"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="DP_FPU"/>
            <compile header="same70a/include/sam.h" define="__SAME70J19__"/>
            <debug svd="same70a/svd/ATSAME70J19.svd"/>
            <memory id="IROM1"
                    start="0x00400000"
                    size="0x00080000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00040000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="same70a/atdf/ATSAME70J19.atdf"/>
                  <at:variant ordercode="ATSAME70J19A-AN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SYSTEM"
                             start="0xE0000000"
                             size="0x10000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="QSPIMEM"
                             start="0x80000000"
                             size="0x20000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="AXIMX"
                             start="0xA0000000"
                             size="0x00100000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="ITCM"
                             start="0x00000000"
                             size="0x00200000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IFLASH"
                             start="0x00400000"
                             size="0x00080000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IROM"
                             start="0x00800000"
                             size="0x00004000"
                             type="rom"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x20000000"
                             size="0x00020000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM"
                             start="0x20400000"
                             size="0x00040000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="SDRAM_CS"
                             start="0x70000000"
                             size="0x10000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="same70a/edc/ATSAME70J19.PIC"/>
               </mchp:extension>
            </environment>
            <description>ARM® Cortex®-M7 microcontroller with 512kB Flash, 256kB SRAM, QSPI, 10/100Mbps Ethernet-AVB MAC with traffic shaping, CAN-FD, Full-Speed USB Host and Device, CMOS Camera Interface, Single ADC and DAC, 1 Analog Comparator, 1 SSC, 2 USARTs/SPI, 1 SPI, 2 TWI, 3 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, 64 pins</description>
            <book name="http://www.atmel.com/images/Atmel-11296-32-bit-Cortex-M7-Microcontroller-SAM-E70Q-SAM-E70N-SAM-E70J_Datasheet.pdf"
                  title="Datasheet"/>
            <book name="http://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70J19"
                  title="Device page for ATSAME70J19"/>
         </device>
         <device Dname="ATSAME70Q20">
            <processor Dcore="Cortex-M7"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="DP_FPU"/>
            <compile header="same70a/include/sam.h" define="__SAME70Q20__"/>
            <debug svd="same70a/svd/ATSAME70Q20.svd"/>
            <memory id="IROM1"
                    start="0x00400000"
                    size="0x00100000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x00800000" size="0x00004000"/>
            <memory id="IRAM1" start="0x20400000" size="0x00060000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="same70a/atdf/ATSAME70Q20.atdf"/>
                  <at:variant ordercode="ATSAME70Q20A-CN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:variant ordercode="ATSAME70Q20A-AN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:variant ordercode="ATSAME70Q20A-CFN"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+105"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SYSTEM"
                             start="0xE0000000"
                             size="0x10000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="QSPIMEM"
                             start="0x80000000"
                             size="0x20000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="AXIMX"
                             start="0xA0000000"
                             size="0x00100000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="ITCM"
                             start="0x00000000"
                             size="0x00200000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IFLASH"
                             start="0x00400000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IROM"
                             start="0x00800000"
                             size="0x00004000"
                             type="rom"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x20000000"
                             size="0x00020000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM"
                             start="0x20400000"
                             size="0x00060000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="EBI_CS0"
                             start="0x60000000"
                             size="0x01000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="EBI_CS1"
                             start="0x61000000"
                             size="0x01000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="EBI_CS2"
                             start="0x62000000"
                             size="0x01000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="EBI_CS3"
                             start="0x63000000"
                             size="0x01000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="SDRAM_CS"
                             start="0x70000000"
                             size="0x10000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="same70a/edc/ATSAME70Q20.PIC"/>
               </mchp:extension>
            </environment>
            <description>ARM® Cortex®-M7 microcontroller with 1MB Flash, 384kB SRAM, QSPI, 10/100Mbps Ethernet-AVB MAC with traffic shaping, dual CAN-FD, SD/MMC, High-speed USB Host and Device, CMOS Camera Interface, Dual ADC, DAC, 1 Analog Comparator, 1 SSC, 3 USARTs/SPI, 2 SPI, 3 TWI, 5 UARTs, True random Number Generator, SHA-256, AES-256, low-power backup with 1KB SRAM, External Bus Interface, SDRAM Controller, 144 pins</description>
            <book name="http://www.atmel.com/images/Atmel-11296-32-bit-Cortex-M7-Microcontroller-SAM-E70Q-SAM-E70N-SAM-E70J_Datasheet.pdf"
                  title="Datasheet"/>
            <book name="http://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAME70Q20"
                  title="Device page for ATSAME70Q20"/>
         </device>
