Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/Atmel.SAME70_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70J21B">
         <description>Headers and startup code for Atmel ATSAME70J21B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70j21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70j21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70j21b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70j21b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70j21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70j21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70j21b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70j21b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70J20B">
         <description>Headers and startup code for Atmel ATSAME70J20B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70j20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70j20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70j20b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70j20b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70j20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70j20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70j20b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70j20b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70Q19">
         <description>Headers and startup code for Atmel ATSAME70Q19</description>
         <files>
            <file condition="C" category="include" name="same70a/include"/>
            <file condition="C" category="header" name="same70a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70a/gcc/gcc/startup_same70q19.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70a/gcc/system_same70q19.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70a/gcc/gcc/same70q19_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70a/gcc/gcc/same70q19_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70a/iar/iar/startup_same70q19.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70a/iar/system_same70q19.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70a/iar/config/linker/Microchip/atsame70q19/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70a/iar/config/linker/Microchip/atsame70q19/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70Q20B">
         <description>Headers and startup code for Atmel ATSAME70Q20B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70q20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70q20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70q20b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70q20b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70q20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70q20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70q20b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70q20b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70J19B">
         <description>Headers and startup code for Atmel ATSAME70J19B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70j19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70j19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70j19b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70j19b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70j19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70j19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70j19b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70j19b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70N21">
         <description>Headers and startup code for Atmel ATSAME70N21</description>
         <files>
            <file condition="C" category="include" name="same70a/include"/>
            <file condition="C" category="header" name="same70a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70a/gcc/gcc/startup_same70n21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70a/gcc/system_same70n21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70a/gcc/gcc/same70n21_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70a/gcc/gcc/same70n21_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70a/iar/iar/startup_same70n21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70a/iar/system_same70n21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70a/iar/config/linker/Microchip/atsame70n21/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70a/iar/config/linker/Microchip/atsame70n21/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70N20">
         <description>Headers and startup code for Atmel ATSAME70N20</description>
         <files>
            <file condition="C" category="include" name="same70a/include"/>
            <file condition="C" category="header" name="same70a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70a/gcc/gcc/startup_same70n20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70a/gcc/system_same70n20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70a/gcc/gcc/same70n20_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70a/gcc/gcc/same70n20_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70a/iar/iar/startup_same70n20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70a/iar/system_same70n20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70a/iar/config/linker/Microchip/atsame70n20/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70a/iar/config/linker/Microchip/atsame70n20/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70N21B">
         <description>Headers and startup code for Atmel ATSAME70N21B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70n21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70n21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70n21b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70n21b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70n21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70n21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70n21b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70n21b/sram.icf"
                  attr="config"/>
         </files>
      </component>
