Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/Atmel.SAME70_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70N20B">
         <description>Headers and startup code for Atmel ATSAME70N20B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70n20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70n20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70n20b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70n20b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70n20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70n20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70n20b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70n20b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70N19B">
         <description>Headers and startup code for Atmel ATSAME70N19B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70n19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70n19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70n19b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70n19b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70n19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70n19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70n19b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70n19b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAME70Q19B">
         <description>Headers and startup code for Atmel ATSAME70Q19B</description>
         <files>
            <file condition="C" category="include" name="same70b/include"/>
            <file condition="C" category="header" name="same70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="same70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="same70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/gcc/startup_same70q19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="same70b/gcc/system_same70q19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="same70b/gcc/gcc/same70q19b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="same70b/gcc/gcc/same70q19b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/iar/startup_same70q19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="same70b/iar/system_same70q19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="same70b/iar/config/linker/Microchip/atsame70q19b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="same70b/iar/config/linker/Microchip/atsame70q19b/sram.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
